In [1]:
import pandas as pd
import math
import numpy as np

In [2]:
data={"age":[25,30,22,25,35],"salary":[1,2,1.3,3,4],"pred":["y","y","n","n","y"]}
df=pd.DataFrame(data)
nage=23
nsalary=2.0
df

   age  salary pred
0   25     1.0    y
1   30     2.0    y
2   22     1.3    n
3   25     3.0    n
4   35     4.0    y

In [3]:
math.sqrt((nage-df["age"])**2-(nsalary-df["salary"])**2)

TypeError: cannot convert the series to <class 'float'>

In [9]:
import math
x=((nage-df["age"])**2-(nsalary-df["salary"])**2)
x
df["val"]=x
df

   age  salary pred     val
0   25     1.0    y    3.00
1   30     2.0    y   49.00
2   22     1.3    n    0.51
3   25     3.0    n    3.00
4   35     4.0    y  140.00

In [6]:
n=df.sort_values("val",ascending=False)
n

   age  salary pred     val
4   35     4.0    y  140.00
1   30     2.0    y   49.00
0   25     1.0    y    3.00
3   25     3.0    n    3.00
2   22     1.3    n    0.51

In [13]:
w=n.tail(3).value_counts("pred")

In [14]:
w

pred
n    2
y    1
dtype: int64

In [16]:
w[0]

2